# Mac Setup 2026 — Brewfile
# Install all: brew bundle --file=Brewfile

# --- CLI Tools ---
brew "bat"              # Better cat with syntax highlighting
brew "fd"               # Fast file finder (better find)
brew "ffmpeg"           # Audio/video processing (needed by Hermes)
brew "fnm"              # Fast Node.js version manager
brew "fzf"              # Fuzzy finder (Ctrl+R, Ctrl+T, Alt+C)
brew "gh"               # GitHub CLI
brew "git"              # Version control
brew "git-delta"        # Better git diffs (side-by-side)
brew "htop"             # Interactive process viewer
brew "jq"               # JSON parsing
brew "pnpm"             # Fast Node.js package manager
brew "ripgrep"          # Fast code search (used by Claude Code & Hermes)
brew "tmux"             # Terminal multiplexer (keep agents alive)
brew "tree"             # Directory tree view
brew "wget"             # File downloader

# --- GUI Apps ---
cask "aldente"          # Battery charge limiter (cap at 80%)
cask "appcleaner"       # Complete app uninstaller
cask "arc"              # Chromium-based browser
cask "bitwarden"        # Password manager (open-source)
cask "cursor"           # AI-native code editor
cask "jordanbaird-ice"  # Menubar manager
cask "obsidian"         # Markdown knowledge base
cask "stats"            # System monitor in menubar
cask "tableplus"        # Database GUI
cask "tailscale"        # Mesh VPN for remote access
cask "vlc"              # Media player
cask "warp"             # Modern terminal

# --- Fonts ---
cask "font-meslo-lg-nerd-font"  # Nerd Font for Powerlevel10k
